app/Controllers/AdjustmentController.php

    public function create($id)
    {
        $product = new ProductModel();

        $data['product'] = $product->table('product')
            ->where('id', $id)
            ->get()
            ->getFirstRow();
---
SELECT *
FROM `product`
WHERE `id` = '5'