app/Controllers/AuthController.php

    public function auth()
    {
        $session = session();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // user
        $user = new UserModel();
        $data = $user->where('email', $email)->first();
---
SELECT *
FROM `user`
WHERE `email` = 'fini@gmail.com'
 LIMIT 1