app/Controllers/BalanceController.php

    public function index()
    {
        $balance = new BalanceModel();
        $warehouse = session()->get('warehouse');
        $role = session()->get('role');

        $date_now = Time::now('Asia/Jakarta')->toDateString();
        $date_yesterday = Time::now('Asia/Jakarta')->subDays(1)->toDateString();

        // check balance tanggal hari ini
        $today_balance = $balance->table('balance')
            ->where('DATE(date)', $date_now)
            ->get()
            ->getResult();

        if (count($today_balance) == 0) {
            // check balance tanggal sebelumnya
            $last_date_balance = $balance->table('balance')
                ->where('DATE(date)', $date_yesterday)
                ->get()
                ->getResult();

            // store new balance
            $insert = new BalanceModel();
            foreach ($last_date_balance as $key => $value) {
                $insert->insert([
                    'app_name' => $value->app_name,
                    'balance_open' => $value->balance_close,
                    'status' => $value->status,
                    'date' => Time::now('Asia/Jakarta'),
                    'warehouse' => $value->warehouse
                ]);
---
SELECT *
FROM `balance`
WHERE DATE(date) = '2025-04-29'
SELECT *
FROM `balance`
WHERE DATE(date) = '2025-04-28'
INSERT INTO `balance` (`app_name`, `balance_open`, `status`, `date`, `warehouse`) VALUES ('Seabank', '500000', '1', '2025-04-29 00:18:29', 'melati')

            return view('balance/index_owner', $data);
        } else {
            $balance = new BalanceModel();
            $data['balances'] = $balance->table('balance')
                ->where('warehouse', $warehouse)
                ->where('DATE(date)', $date_now)
                ->get()
                ->getResult();
---
SELECT *
FROM `balance`
WHERE `warehouse` = 'melati'
AND DATE(date) = '2025-04-29'

    public function get_data_by_id()
    {
        if (session()->get('role') == "owner") {
            $warehouse = $this->request->getPost('warehouse');
        } else {
            $warehouse = session()->get('warehouse');
        }

        $id = $this->request->getPost('id'); // Ambil id dari AJAX
        $date_now = Time::now('Asia/Jakarta')->toDateString();

        $balance = new BalanceAdjustmentModel();
        $data['balance_adjustments'] = $balance->table('balance_adjustment')
                ->where('warehouse', $warehouse)
                ->where('DATE(date)', $date_now)
                ->where('balance_id', $id)
                ->orderBy('id', 'DESC')
                ->get()
                ->getResult();
---
SELECT *
FROM `balance_adjustment`
WHERE `warehouse` = 'melati'
AND DATE(date) = '2025-04-28'
AND `balance_id` = '67'
ORDER BY `id` DESC