app/Controllers/CashController.php

SELECT *
FROM `cash_open`
WHERE `warehouse` = 'melati'
SELECT *
FROM `cash_close`
WHERE `warehouse` = 'melati'
---
    public function index()
    {
        // product
        $warehouse = session()->get('warehouse');
        $role = session()->get('role');
        $data['desc_cash'] = null;
        $data['cash_session'] = null;

        if ($role == "owner") {
            return view('cash/index_owner', $data);
        } else {
            $cash_open = new CashOpenModel();
            $data['cash_open'] = $cash_open->table('cash_open')
                ->where('warehouse', $warehouse)
                ->get()
                ->getFirstRow();

            $cash_close = new CashCloseModel();
            $data['cash_close'] = $cash_close->table('cash_close')
                ->where('warehouse', $warehouse)
                ->get()
                ->getFirstRow();