app/Controllers/HomeController.php

SELECT `sales`.`product_code`, `sales`.`amount`, `sales`.`date`, `product`.`name`
FROM `sales`
RIGHT JOIN `product` ON `product`.`id` = `sales`.`product_id`
WHERE `warehouse` = 'melati'
ORDER BY `sales`.`id` DESC
---
    public function dashboard()
    {
        $sales = new SalesModel();
        $warehouse = session()->get('warehouse');

        $data['sales'] = $sales->table('sales')
        ->select('sales.product_code, sales.amount, sales.date, product.name')
        ->join('product', 'product.id = sales.product_id', 'right')
        ->where('warehouse', $warehouse)
        ->orderBy('sales.id', 'DESC')
        ->get()
        ->getResult();