app/Controllers/IncomeController.php

    public function index()
    {
        // product
        $app = new IncomeModel();
        $warehouse = session()->get('warehouse');
        $date_now = Time::now('Asia/Jakarta')->toDateString();

        $data['incomes'] = $app->table('income')
            ->where('warehouse', $warehouse)
            ->where('DATE(date)', $date_now)
            ->orderBy('id', 'DESC')
            ->get()
            ->getResult();
---
SELECT *
FROM `income`
WHERE `warehouse` = 'srengseng'
AND DATE(date) = '2025-04-28'
ORDER BY `id` DESC

    public function store()
    {
        $income = new IncomeModel();
        $warehouse = session()->get('warehouse');

        $income->insert([
            'description' => $this->request->getPost('description'),
            'amount' => intval(str_replace('.', '', $this->request->getPost('amount'))),
            'date' => Time::now('Asia/Jakarta'),
            'warehouse' => $warehouse,
            'user' => session()->get('name')
        ]);
---
INSERT INTO `income` (`description`, `amount`, `date`, `warehouse`, `user`) VALUES ('Affiliate', 887786, '2025-04-28 00:03:30', 'srengseng', 'Sari Novita')