app/Controllers/ProductController.php

    public function index()
    {
        // product
        $app = new ProductModel();
        $warehouse = session()->get('warehouse');
        $role = session()->get('role');

        if ($role == "owner") {
            $data['products'] = $app->table('product')
                ->select('product.*, stock.qty')
                ->join('stock', 'product.id = stock.product_id', 'right')
                ->get()
                ->getResult();
        } else {
            $data['products'] = $app->table('product')
                ->select('product.*, stock.qty')
                ->join('stock', 'product.id = stock.product_id', 'right')
                ->where('warehouse', $warehouse)
                ->get()
                ->getResult();
---
SELECT `product`.*, `stock`.`qty`
FROM `product`
RIGHT JOIN `stock` ON `product`.`id` = `stock`.`product_id`
WHERE `warehouse` = 'melati'