app/Controllers/SalesController.php

    public function index()
    {
        $sales = new SalesModel();
        $warehouse = session()->get('warehouse');
        $date_now = Time::now('Asia/Jakarta')->toDateString();


        $data['sales'] = $sales->table('sales')
            ->select('sales.id, sales.product_code, sales.amount, sales.date, product.name')
            ->join('product', 'product.id = sales.product_id', 'right')
            ->where('warehouse', $warehouse)
            ->where('DATE(date)', $date_now)
            ->orderBy('sales.id', 'DESC')
            ->get()
            ->getResult();
---
SELECT `sales`.`id`, `sales`.`product_code`, `sales`.`amount`, `sales`.`date`, `product`.`name`
FROM `sales`
RIGHT JOIN `product` ON `product`.`id` = `sales`.`product_id`
WHERE `warehouse` = 'melati'
AND DATE(date) = '2025-04-30'
ORDER BY `sales`.`id` DESC

    public function ajax_result()
    {
        $product = new ProductModel();
        $keyword = $this->request->getPost('keyword');

        $data['results'] = $product->table('product')
            ->join('stock', 'product.id = stock.product_id', 'right')
            ->distinct()
            ->where('warehouse', session()->get('warehouse'))
            ->groupStart() // Grouping untuk LIKE dan OR LIKE
            ->like('name', $keyword)
            ->orLike('code', $keyword)
            ->groupEnd() // Tutup grup
            ->get()
            ->getResult();
---
SELECT DISTINCT *
FROM `product`
RIGHT JOIN `stock` ON `product`.`id` = `stock`.`product_id`
WHERE `warehouse` = 'melati'
AND   (
`name` LIKE '%2,5%' ESCAPE '!'
OR  `code` LIKE '%2,5%' ESCAPE '!'
 )

    public function store_fee_fixed()
    {
        $product = new ProductModel();
        $warehouse = session()->get('warehouse');
        $product_id = $this->request->getPost('product_id');

        $productdb = $product->table('product')
            ->select('product.*, stock.qty, stock.qty_alert, stock.id as stock_id')
            ->join('stock', 'product.id = stock.product_id', 'right')
            ->where('warehouse', $warehouse)
            ->where('stock.product_id', $product_id)->get()->getFirstRow();

        $qty_order = intval($this->request->getPost('qty_order'));
        $discount = intval($this->request->getPost('discount'));
        $final_amount = ($qty_order * $productdb->selling_price) - $discount;

        $sales = new SalesModel();
        $sales->insert([
            'product_id' => $productdb->id,
            'product_code' => $productdb->code,
            'qty' => $this->request->getPost('qty_order'),
            'base_price' => $productdb->base_price,
            'selling_price' => $productdb->selling_price,
            'amount' => $final_amount,
            'discount' => $discount,
            'date' => Time::now('Asia/Jakarta'),
            'warehouse' => $warehouse,
            'user' => session()->get('name'),
        ]);
---
SELECT `product`.*, `stock`.`qty`, `stock`.`qty_alert`, `stock`.`id` as `stock_id`
FROM `product`
RIGHT JOIN `stock` ON `product`.`id` = `stock`.`product_id`
WHERE `warehouse` = 'melati'
AND `stock`.`product_id` = '162'
INSERT INTO `sales` (`product_id`, `product_code`, `qty`, `base_price`, `selling_price`, `amount`, `discount`, `date`, `warehouse`, `user`) VALUES ('162', 'VOC2,5GB', '1', '15000', '25000', 25000, 0, '2025-04-30 06:46:46', 'melati', 'Fini Anggraini Safitri')

    public function edit($id)
    {
        $sales = new SalesModel();
        $sales_data = $sales->where('sales.id', $id)
            ->select('sales.*, product.code, product.name, product.product_type')
            ->join('product', 'sales.product_id = product.id', 'left')
            ->get()->getFirstRow();

        if ($sales_data->product_type == "fee_fixed") {
            $warehouse = session()->get('warehouse');
            $sales_data = $sales->where('sales.id', $id)
                ->select('sales.*, product.code, product.name, product.product_type, stock.qty as qty_stock')
                ->join('product', 'sales.product_id = product.id', 'left')
                ->join('stock', 'product.id = stock.product_id', 'right')
                ->where('stock.warehouse', $warehouse)
                ->get()->getFirstRow();
---
SELECT `sales`.*, `product`.`code`, `product`.`name`, `product`.`product_type`
FROM `sales`
LEFT JOIN `product` ON `sales`.`product_id` = `product`.`id`
WHERE `sales`.`id` = '31'
SELECT `sales`.*, `product`.`code`, `product`.`name`, `product`.`product_type`, `stock`.`qty` as `qty_stock`
FROM `sales`
LEFT JOIN `product` ON `sales`.`product_id` = `product`.`id`
RIGHT JOIN `stock` ON `product`.`id` = `stock`.`product_id`
WHERE `sales`.`id` = '31'
AND `stock`.`warehouse` = 'melati'