app/Controllers/StockController.php

    public function index()
    {
        // product
        $app = new ProductModel();
        $warehouse = session()->get('warehouse');

        $data['products'] = $app->table('product')
            ->select('product.*, stock.qty, stock.id as stock_id')
            ->join('stock', 'product.id = stock.product_id', 'right')
            ->where('warehouse', $warehouse)
            ->where('stock.modified_at IS NULL')
            ->where('product.product_type', 'fee_fixed')
            ->get()
            ->getResult();
---
SELECT `product`.*, `stock`.`qty`, `stock`.`id` as `stock_id`
FROM `product`
RIGHT JOIN `stock` ON `product`.`id` = `stock`.`product_id`
WHERE `warehouse` = 'melati'
AND `stock`.`modified_at` IS NULL
AND `product`.`product_type` = 'fee_fixed'